{
  "broadArea": {
    "name": "Electronics and Communication Engineering",
    "link": "https://www.vlab.co.in/broad-area-electronics-and-communications",
    "code": "ECE"
  },
  "lab": "Virtual Hybrid Elecronics Lab",
  "lab_display_name": "Hybrid Electronics Lab",
  "deployLab": true,
  "phase": 2,
  "collegeName": "COEP",
  "baseUrl": "he-coep.vlabs.ac.in",
  "introduction": "Analog electronics are electronic systems with a continuously variable signal, in contrast to digital electronics where signals usually take only two levels. The basic electronic components of analog circuits are Passive (Resistors, Capacitors, Inductors) and active (Op-amps). An Analog signal is a continuous signal which represents physical measurements. Digital signals are discrete-time signals generated by digital modulation. Example Human voice in the air, analog electronic devices. Computers, CDs, DVDs, and other digital electronic devices. Hybrid electronics cover both analog and digital circuits. A hybrid electronic lab explores the design, construction/building, and debugging of analog electronic and digital electronic circuits.",
  "experiments": [
    {
      "name": "Design and Implementation of Various Arithmetic Circuits",
      "short-name": "various-arithmetic-circuits",
      "repo": "https://github.com/virtual-labs/exp-various-arithmetic-circuits-coep",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Design and Simulate Various Code Converters",
      "short-name": "various-code-converters",
      "repo": "https://github.com/virtual-labs/exp-various-code-converters-coep",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Design and Simulation of Various Counters and Shift Registers",
      "short-name": "shift-registers",
      "repo": "https://github.com/virtual-labs/exp-shift-registers-coep",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Design and Simulation of Arithmetic Logic Unit",
      "short-name": "arithmetic-logic-unit",
      "repo": "https://github.com/virtual-labs/exp-arithmetic-logic-unit-coep",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Design and Simulation of Decoders, Encoders, Multiplexer, and Demultiplexer",
      "short-name": "decoders-encodersmultiplexer-demultiplexer",
      "repo": "https://github.com/virtual-labs/exp-decoders-encodersmultiplexer-demultiplexer-coep",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Design and Simulate Analog to Digital Converter and Digital to Analog Converter",
      "short-name": "digital-analog-converter",
      "repo": "https://github.com/virtual-labs/exp-digital-analog-converter-coep",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Implementation of a monostable and astable oscillator using IC 555",
      "short-name": "monostable-astable-oscillator",
      "repo": "https://github.com/virtual-labs/exp-monostable-astable-oscillator-coep",
      "tag": "v1.0.0",
      "deploy": true
    }
  ],
  "targetAudience": {
    "UG": [
      "Undergraduate students of Instrumentation and Control Engineering, Mechatronics Engineering, and Electronics and electrical engineering branches."
    ],
    "PG": [
      "Post-graduate students of Process Instrumentation, Mechatronics, and Production Engineering."
    ]
  },
  "objective": " - To study, design, and realize combinational circuits such as arithmetic circuits, code converters</br></br> - To study, design, and realize sequential circuits such as flip flops, shift registers</br></br> - To analyze multiplexers, demultiplexers, encoders, and decodes and their usage in a practical situation.</br></br> - To study interface devices such as ADC, and DAC, their specification parameters, and applications</br></br> - To design and realize a square wave generator.",
  "courseAlignment": {
    "description": "The syllabi of this lab aligns to the following universities in India",
    "universities": [
      "Pune University",
      "Indian Institute of Technology Bombay",
      "Indian Institute of Technology Delhi",
      "BMS College of Engineering, Bangalore",
      "Institute has an Instrumentation and control department",
      "Institute has an Electronics and electrical engineering department"
    ]
  }
}